# SetTexSpace2DRadius

## Description
Procedure SetTexSpace2DRadius sets the radius of the referenced texture space for applicable mapping types.

```pascal
PROCEDURE SetTexSpace2DRadius(
				textureSpace : HANDLE;
				radius       : REAL);
```

```python

def vs.SetTexSpace2DRadius(textureSpace, radius):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|textureSpace|HANDLE|Handle to texture space.|
|radius|REAL|Radius of texture space.|

## Remarks
For applicable mapping types, sets the radius of the texture space.

## Version
```diff
- SetTexSpace2DRadius is obsolete as of Vectorworks 2009
```

Availability: from VectorWorks8.0
## Category
* Textures